// Функция ggg принимает 2 параметра: число и анонимную функцию, которая возводит число в квадрат. Возведите число в 4-тую степень с помощью ggg.
'use strict'

/*
function ggg(num, func){
	
	return func(num);

}


console.log(ggg(4,function(that){
	return that**4
}))

*/



// Функция ggg принимает 2 параметра: анонимную функцию, которая возвращает 3 и анонимную функцию, которая возвращает 4. Верните результатом функции ggg сумму 3 и 4.


/*
function ggg(func1,func2){
	return (func1()+func2());
}

console.log(ggg((()=> 3 ),()=>4))
*/



